src/InformationRegisters/СвязкаПомещениеСотрудник.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>СвязкаПомещениеСотрудник</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Основное</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СвязкаПомещениеСотрудник/Ext/ManagerModule.bsl
#Область СлужебныеПроцедурыИФункции

//
// <Описание Функции>
//
// Параметры
//  <Сотрудник>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <СтруктурнаяЕдиница>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Функция ПолучитьПомещениеСотрудникаПоУмолчанию(Сотрудник, СтруктурнаяЕдиница) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СвязкаПомещениеСотрудник.Помещение
		|ИЗ
		|	РегистрСведений.СвязкаПомещениеСотрудник КАК СвязкаПомещениеСотрудник
		|ГДЕ
		|	СвязкаПомещениеСотрудник.Сотрудник = &Сотрудник
		|	И СвязкаПомещениеСотрудник.Помещение.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
		|	И СвязкаПомещениеСотрудник.Основное = ИСТИНА";

	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", СтруктурнаяЕдиница);

	ВыборкаДетальныеЗаписи = Запрос.Выполнить().Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Помещение;
	Иначе
		Возврат Неопределено;
	КонецЕсли;

КонецФункции // ПолучитьПомещениеПоУмолчанию()

#КонецОбласти
